In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("student_scores.csv")
df.head()

   Student_ID    Name  Gender  Class  Math_Score  Science_Score  English_Score
0           1     Ali    Male     10          85             78             92
1           2  Ayesha  Female     10          90             88             95
2           3  Hassan    Male      9          72             67             70
3           4    Sana  Female      9          95             99             98
4           5   Usman    Male     10          60             55             65

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Student_ID     10 non-null     int64
 1   Name           10 non-null     object
 2   Gender         10 non-null     object
 3   Class          10 non-null     int64
 4   Math_Score     10 non-null     int64
 5   Science_Score  10 non-null     int64
 6   English_Score  10 non-null     int64
dtypes: int64(5), object(2)
memory usage: 692.0+ bytes

In [6]:
df.isnull().sum()

Student_ID       0
Name             0
Gender           0
Class            0
Math_Score       0
Science_Score    0
English_Score    0
dtype: int64

In [7]:
df.describe()

       Student_ID      Class  Math_Score  Science_Score  English_Score
count    10.00000  10.000000   10.000000      10.000000      10.000000
mean      5.50000   9.500000   82.100000      80.800000      85.100000
std       3.02765   0.527046   10.397115      12.699956      10.836666
min       1.00000   9.000000   60.000000      55.000000      65.000000
25%       3.25000   9.000000   77.750000      75.750000      80.250000
50%       5.50000   9.500000   84.000000      83.500000      87.500000
75%       7.75000  10.000000   89.500000      88.750000      92.750000
max      10.00000  10.000000   95.000000      99.000000      98.000000

In [8]:
df.columns = df.columns.str.strip().str.lower().str.replace(" ", "_")
df.head()

   student_id    name  gender  class  math_score  science_score  english_score
0           1     Ali    Male     10          85             78             92
1           2  Ayesha  Female     10          90             88             95
2           3  Hassan    Male      9          72             67             70
3           4    Sana  Female      9          95             99             98
4           5   Usman    Male     10          60             55             65

In [9]:
df["average_score"] = df[["math_score", "science_score", "english_score"]].mean(axis=1)
df.head()

,student_id,name,gender,class,math_score,science_score,english_score,average_score
0,1,Ali,Male,10,85,78,92,85.000000
1,2,Ayesha,Female,10,90,88,95,91.000000
2,3,Hassan,Male,9,72,67,70,69.666667
3,4,Sana,Female,9,95,99,98,97.333333
4,5,Usman,Male,10,60,55,65,60.000000

In [11]:
df.groupby("gender")[["math_score", "science_score", "english_score"]].mean()

        math_score  science_score  english_score
gender
Female        87.8           90.2           92.2
Male          76.4           71.4           78.0

In [17]:
df[df['math_score'] > 80][['name', 'math_score']]

      name  math_score
0      Ali          85
1   Ayesha          90
3     Sana          95
6    Ahmed          88
7     Noor          91
9  Mahnoor          83

In [19]:
for subject in ['math_score', 'science_score', 'english_score']:
    count = (df[subject] > 80).sum()
    print(f"{subject.replace('_', ' ')}: {count} students scored above 80")

math score: 6 students scored above 80
science score: 6 students scored above 80
english score: 7 students scored above 80